float12/WorkProjectsSVN/ElectricityCycle/program/主控4A0/BOOT/Project/EWARM/config/HC32F4A0PGTB.svd
                <register>
                    <name>F1NWPRT0</name>
                    <description>desc F1NWPRT0</description>
                    <addressOffset>0x1A0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>F1NWPRT0</name>
                            <description>desc F1NWPRT0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT1</name>
                            <description>desc F1NWPRT1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT2</name>
                            <description>desc F1NWPRT2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT3</name>
                            <description>desc F1NWPRT3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT4</name>
                            <description>desc F1NWPRT4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT5</name>
                            <description>desc F1NWPRT5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT6</name>
                            <description>desc F1NWPRT6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT7</name>
                            <description>desc F1NWPRT7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT8</name>
                            <description>desc F1NWPRT8</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT9</name>
                            <description>desc F1NWPRT9</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT10</name>
                            <description>desc F1NWPRT10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT11</name>
                            <description>desc F1NWPRT11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT12</name>
                            <description>desc F1NWPRT12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT13</name>
                            <description>desc F1NWPRT13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT14</name>
                            <description>desc F1NWPRT14</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT15</name>
                            <description>desc F1NWPRT15</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT16</name>
                            <description>desc F1NWPRT16</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT17</name>
                            <description>desc F1NWPRT17</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT18</name>
                            <description>desc F1NWPRT18</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT19</name>
                            <description>desc F1NWPRT19</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT20</name>
                            <description>desc F1NWPRT20</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT21</name>
                            <description>desc F1NWPRT21</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT22</name>
                            <description>desc F1NWPRT22</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT23</name>
                            <description>desc F1NWPRT23</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT24</name>
                            <description>desc F1NWPRT24</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT25</name>
                            <description>desc F1NWPRT25</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT26</name>
                            <description>desc F1NWPRT26</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT27</name>
                            <description>desc F1NWPRT27</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT28</name>
                            <description>desc F1NWPRT28</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT29</name>
                            <description>desc F1NWPRT29</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT30</name>
                            <description>desc F1NWPRT30</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT31</name>
                            <description>desc F1NWPRT31</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1NWPRT1</name>
                    <description>desc F1NWPRT1</description>
                    <addressOffset>0x1A4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>F1NWPRT32</name>
                            <description>desc F1NWPRT32</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT33</name>
                            <description>desc F1NWPRT33</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT34</name>
                            <description>desc F1NWPRT34</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT35</name>
                            <description>desc F1NWPRT35</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT36</name>
                            <description>desc F1NWPRT36</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT37</name>
                            <description>desc F1NWPRT37</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT38</name>
                            <description>desc F1NWPRT38</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT39</name>
                            <description>desc F1NWPRT39</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT40</name>
                            <description>desc F1NWPRT40</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT41</name>
                            <description>desc F1NWPRT41</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT42</name>
                            <description>desc F1NWPRT42</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT43</name>
                            <description>desc F1NWPRT43</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT44</name>
                            <description>desc F1NWPRT44</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT45</name>
                            <description>desc F1NWPRT45</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT46</name>
                            <description>desc F1NWPRT46</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT47</name>
                            <description>desc F1NWPRT47</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT48</name>
                            <description>desc F1NWPRT48</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT49</name>
                            <description>desc F1NWPRT49</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT50</name>
                            <description>desc F1NWPRT50</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT51</name>
                            <description>desc F1NWPRT51</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT52</name>
                            <description>desc F1NWPRT52</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT53</name>
                            <description>desc F1NWPRT53</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT54</name>
                            <description>desc F1NWPRT54</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT55</name>
                            <description>desc F1NWPRT55</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT56</name>
                            <description>desc F1NWPRT56</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT57</name>
                            <description>desc F1NWPRT57</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT58</name>
                            <description>desc F1NWPRT58</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT59</name>
                            <description>desc F1NWPRT59</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT60</name>
                            <description>desc F1NWPRT60</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT61</name>
                            <description>desc F1NWPRT61</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT62</name>
                            <description>desc F1NWPRT62</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT63</name>
                            <description>desc F1NWPRT63</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
