float12/WorkProjectsSVN/ElectricityCycle/program/主控4A0/BOOT/Project/EWARM/config/HC32F4A0PGTB.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="TMRA1">
            <name>TMRA10</name>
            <description>desc TMRA</description>
            <baseAddress>0x40027400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x150</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="TMRA1">
            <name>TMRA11</name>
            <description>desc TMRA</description>
            <baseAddress>0x40027800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x150</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="TMRA1">
            <name>TMRA12</name>
            <description>desc TMRA</description>
            <baseAddress>0x40027C00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x150</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="TMRA1">
            <name>TMRA2</name>
            <description>desc TMRA</description>
            <baseAddress>0x4003A400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x150</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="TMRA1">
            <name>TMRA3</name>
            <description>desc TMRA</description>
            <baseAddress>0x4003A800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x150</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="TMRA1">
            <name>TMRA4</name>
            <description>desc TMRA</description>
            <baseAddress>0x4003AC00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x150</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="TMRA1">
            <name>TMRA5</name>
            <description>desc TMRA</description>
            <baseAddress>0x40026000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x150</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="TMRA1">
            <name>TMRA6</name>
            <description>desc TMRA</description>
            <baseAddress>0x40026400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x150</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="TMRA1">
            <name>TMRA7</name>
            <description>desc TMRA</description>
            <baseAddress>0x40026800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x150</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="TMRA1">
            <name>TMRA8</name>
            <description>desc TMRA</description>
            <baseAddress>0x40026C00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x150</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="TMRA1">
            <name>TMRA9</name>
            <description>desc TMRA</description>
            <baseAddress>0x40027000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x150</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral>
            <name>TRNG</name>
            <description>desc TRNG</description>
            <baseAddress>0x40042000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x14</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CR</name>
                    <description>desc CR</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3</resetMask>
                    <fields>
                        <field>
                            <name>EN</name>
                            <description>desc EN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RUN</name>
                            <description>desc RUN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MR</name>
                    <description>desc MR</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x12</resetValue>
                    <resetMask>0x1D</resetMask>
                    <fields>
                        <field>
                            <name>LOAD</name>
                            <description>desc LOAD</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CNT</name>
                            <description>desc CNT</description>
                            <msb>4</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DR0</name>
                    <description>desc DR0</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x8000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>DR1</name>
                    <description>desc DR1</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x8000200</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
