float12/WorkProjectsSVN/ElectricityCycle/program/主控4A0/BOOT/Project/EWARM/config/HC32F4A0PGTB.svd
                <register>
                    <name>DOEPTSIZ6</name>
                    <description>desc DOEPTSIZ6</description>
                    <addressOffset>0xBD0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7FFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>XFRSIZ</name>
                            <description>desc XFRSIZ</description>
                            <msb>18</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PKTCNT</name>
                            <description>desc PKTCNT</description>
                            <msb>28</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RXDPID_STUPCNT</name>
                            <description>desc RXDPID_STUPCNT</description>
                            <msb>30</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEPDMA6</name>
                    <description>desc DOEPDMA6</description>
                    <addressOffset>0xBD4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>DOEPCTL7</name>
                    <description>desc DOEPCTL7</description>
                    <addressOffset>0xBE0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFC3F87FF</resetMask>
                    <fields>
                        <field>
                            <name>MPSIZ</name>
                            <description>desc MPSIZ</description>
                            <msb>10</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBAEP</name>
                            <description>desc USBAEP</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DPID</name>
                            <description>desc DPID</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NAKSTS</name>
                            <description>desc NAKSTS</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EPTYP</name>
                            <description>desc EPTYP</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SNPM</name>
                            <description>desc SNPM</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STALL</name>
                            <description>desc STALL</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CNAK</name>
                            <description>desc CNAK</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SNAK</name>
                            <description>desc SNAK</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SD0PID</name>
                            <description>desc SD0PID</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SD1PID</name>
                            <description>desc SD1PID</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPDIS</name>
                            <description>desc EPDIS</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPENA</name>
                            <description>desc EPENA</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEPINT7</name>
                    <description>desc DOEPINT7</description>
                    <addressOffset>0xBE8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x5B</resetMask>
                    <fields>
                        <field>
                            <name>XFRC</name>
                            <description>desc XFRC</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPDISD</name>
                            <description>desc EPDISD</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STUP</name>
                            <description>desc STUP</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OTEPDIS</name>
                            <description>desc OTEPDIS</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>B2BSTUP</name>
                            <description>desc B2BSTUP</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEPTSIZ7</name>
                    <description>desc DOEPTSIZ7</description>
                    <addressOffset>0xBF0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7FFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>XFRSIZ</name>
                            <description>desc XFRSIZ</description>
                            <msb>18</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PKTCNT</name>
                            <description>desc PKTCNT</description>
                            <msb>28</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RXDPID_STUPCNT</name>
                            <description>desc RXDPID_STUPCNT</description>
                            <msb>30</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEPDMA7</name>
                    <description>desc DOEPDMA7</description>
                    <addressOffset>0xBF4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>DOEPCTL8</name>
                    <description>desc DOEPCTL8</description>
                    <addressOffset>0xC00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFC3F87FF</resetMask>
                    <fields>
                        <field>
                            <name>MPSIZ</name>
                            <description>desc MPSIZ</description>
                            <msb>10</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBAEP</name>
                            <description>desc USBAEP</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DPID</name>
                            <description>desc DPID</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NAKSTS</name>
                            <description>desc NAKSTS</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EPTYP</name>
                            <description>desc EPTYP</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SNPM</name>
                            <description>desc SNPM</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STALL</name>
                            <description>desc STALL</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CNAK</name>
                            <description>desc CNAK</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SNAK</name>
                            <description>desc SNAK</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SD0PID</name>
                            <description>desc SD0PID</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SD1PID</name>
                            <description>desc SD1PID</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPDIS</name>
                            <description>desc EPDIS</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPENA</name>
                            <description>desc EPENA</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEPINT8</name>
                    <description>desc DOEPINT8</description>
                    <addressOffset>0xC08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x5B</resetMask>
                    <fields>
                        <field>
                            <name>XFRC</name>
                            <description>desc XFRC</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPDISD</name>
                            <description>desc EPDISD</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STUP</name>
                            <description>desc STUP</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OTEPDIS</name>
                            <description>desc OTEPDIS</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>B2BSTUP</name>
                            <description>desc B2BSTUP</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEPTSIZ8</name>
                    <description>desc DOEPTSIZ8</description>
                    <addressOffset>0xC10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7FFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>XFRSIZ</name>
                            <description>desc XFRSIZ</description>
                            <msb>18</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PKTCNT</name>
                            <description>desc PKTCNT</description>
                            <msb>28</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RXDPID_STUPCNT</name>
                            <description>desc RXDPID_STUPCNT</description>
                            <msb>30</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEPDMA8</name>
                    <description>desc DOEPDMA8</description>
                    <addressOffset>0xC14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>DOEPCTL9</name>
                    <description>desc DOEPCTL9</description>
                    <addressOffset>0xC20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFC3F87FF</resetMask>
                    <fields>
                        <field>
                            <name>MPSIZ</name>
                            <description>desc MPSIZ</description>
                            <msb>10</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBAEP</name>
                            <description>desc USBAEP</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DPID</name>
                            <description>desc DPID</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NAKSTS</name>
                            <description>desc NAKSTS</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EPTYP</name>
                            <description>desc EPTYP</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SNPM</name>
                            <description>desc SNPM</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STALL</name>
                            <description>desc STALL</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CNAK</name>
                            <description>desc CNAK</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SNAK</name>
                            <description>desc SNAK</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SD0PID</name>
                            <description>desc SD0PID</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SD1PID</name>
                            <description>desc SD1PID</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPDIS</name>
                            <description>desc EPDIS</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPENA</name>
                            <description>desc EPENA</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
