float12/WorkProjectsSVN/ElectricityCycle/program/主控4A0/BOOT/Project/EWARM/config/HC32F4A0PGTB.svd
                <register>
                    <name>HCTSIZ15</name>
                    <description>desc HCTSIZ15</description>
                    <addressOffset>0x6F0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>XFRSIZ</name>
                            <description>desc XFRSIZ</description>
                            <msb>18</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PKTCNT</name>
                            <description>desc PKTCNT</description>
                            <msb>28</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DPID</name>
                            <description>desc DPID</description>
                            <msb>30</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DOPING</name>
                            <description>desc DOPING</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCDMA15</name>
                    <description>desc HCDMA15</description>
                    <addressOffset>0x6F4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>DCFG</name>
                    <description>desc DCFG</description>
                    <addressOffset>0x800</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x8220000</resetValue>
                    <resetMask>0x1FF7</resetMask>
                    <fields>
                        <field>
                            <name>DSPD</name>
                            <description>desc DSPD</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NZLSOHSK</name>
                            <description>desc NZLSOHSK</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DAD</name>
                            <description>desc DAD</description>
                            <msb>10</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PFIVL</name>
                            <description>desc PFIVL</description>
                            <msb>12</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DCTL</name>
                    <description>desc DCTL</description>
                    <addressOffset>0x804</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x2</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>RWUSIG</name>
                            <description>desc RWUSIG</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SDIS</name>
                            <description>desc SDIS</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GINSTS</name>
                            <description>desc GINSTS</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>GONSTS</name>
                            <description>desc GONSTS</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TCTL</name>
                            <description>desc TCTL</description>
                            <msb>6</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SGINAK</name>
                            <description>desc SGINAK</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CGINAK</name>
                            <description>desc CGINAK</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SGONAK</name>
                            <description>desc SGONAK</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CGONAK</name>
                            <description>desc CGONAK</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POPRGDNE</name>
                            <description>desc POPRGDNE</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DSTS</name>
                    <description>desc DSTS</description>
                    <addressOffset>0x808</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x2</resetValue>
                    <resetMask>0xFFFF0F</resetMask>
                    <fields>
                        <field>
                            <name>SUSPSTS</name>
                            <description>desc SUSPSTS</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENUMSPD</name>
                            <description>desc ENUMSPD</description>
                            <msb>2</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EERR</name>
                            <description>desc EERR</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNSOF</name>
                            <description>desc FNSOF</description>
                            <msb>21</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LNSTS</name>
                            <description>desc LNSTS</description>
                            <msb>23</msb>
                            <lsb>22</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPMSK</name>
                    <description>desc DIEPMSK</description>
                    <addressOffset>0x810</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x217B</resetMask>
                    <fields>
                        <field>
                            <name>XFRCM</name>
                            <description>desc XFRCM</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPDM</name>
                            <description>desc EPDM</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TOM</name>
                            <description>desc TOM</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TTXFEMSK</name>
                            <description>desc TTXFEMSK</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INEPNMM</name>
                            <description>desc INEPNMM</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INEPNEM</name>
                            <description>desc INEPNEM</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXFURM</name>
                            <description>desc TXFURM</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NAKM</name>
                            <description>desc NAKM</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEPMSK</name>
                    <description>desc DOEPMSK</description>
                    <addressOffset>0x814</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x415B</resetMask>
                    <fields>
                        <field>
                            <name>XFRCM</name>
                            <description>desc XFRCM</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPDM</name>
                            <description>desc EPDM</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STUPM</name>
                            <description>desc STUPM</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OTEPDM</name>
                            <description>desc OTEPDM</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>B2BSTUP</name>
                            <description>desc B2BSTUP</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPEM</name>
                            <description>desc OPEM</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NYETM</name>
                            <description>desc NYETM</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DAINT</name>
                    <description>desc DAINT</description>
                    <addressOffset>0x818</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>IEPINT</name>
                            <description>desc IEPINT</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OEPINT</name>
                            <description>desc OEPINT</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DAINTMSK</name>
                    <description>desc DAINTMSK</description>
                    <addressOffset>0x81C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>IEPINTM</name>
                            <description>desc IEPINTM</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OEPINTM</name>
                            <description>desc OEPINTM</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DTHRCTL</name>
                    <description>desc DTHRCTL</description>
                    <addressOffset>0x830</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xC100020</resetValue>
                    <resetMask>0xBFF07FF</resetMask>
                    <fields>
                        <field>
                            <name>NONISOTHREN</name>
                            <description>desc NONISOTHREN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ISOTHREN</name>
                            <description>desc ISOTHREN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXTHRLEN</name>
                            <description>desc TXTHRLEN</description>
                            <msb>10</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RXTHREN</name>
                            <description>desc RXTHREN</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RXTHRLEN</name>
                            <description>desc RXTHRLEN</description>
                            <msb>25</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ARPEN</name>
                            <description>desc ARPEN</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPEMPMSK</name>
                    <description>desc DIEPEMPMSK</description>
                    <addressOffset>0x834</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>INEPTXFEM</name>
                            <description>desc INEPTXFEM</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DEACHINT</name>
                    <description>desc DEACHINT</description>
                    <addressOffset>0x838</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x20002</resetMask>
                    <fields>
                        <field>
                            <name>IEP1INT</name>
                            <description>desc IEP1INT</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OEP1INT</name>
                            <description>desc OEP1INT</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DEACHINTMSK</name>
                    <description>desc DEACHINTMSK</description>
                    <addressOffset>0x83C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x20002</resetMask>
                    <fields>
                        <field>
                            <name>IEP1INTM</name>
                            <description>desc IEP1INTM</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OEP1INTM</name>
                            <description>desc OEP1INTM</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
